package com.gangukeji.xzqn.utils;

import com.gangukeji.xzqn.dao.ServiceCateDao2;
import com.gangukeji.xzqn.dao.ServicePropDao2;
import com.gangukeji.xzqn.entity.XzqnServiceCate2;
import com.gangukeji.xzqn.entity.XzqnServiceProp2;
import lombok.extern.slf4j.Slf4j;
import org.springframework.boot.ApplicationArguments;
import org.springframework.boot.ApplicationRunner;
import org.springframework.stereotype.Component;

import javax.annotation.Resource;
import java.util.ArrayList;
import java.util.List;

/**
 * @Author: hx
 * @Date: 2019/5/23 10:16
 * @Description: 相当一个常用字段缓存区,直接把数据库数据加载到内存,程序启动后执行
 */
@Component
@Slf4j
public class StatusUtils2 implements ApplicationRunner {
    @Resource
    ServiceCateDao2 cateDao2;
    @Resource
    ServicePropDao2 propDao2;
    public static final List<XzqnServiceCate2> cate2List = new ArrayList<>();
    public static final List<XzqnServiceProp2> prop2List = new ArrayList<>();
    @Override
    public void run(ApplicationArguments args) throws Exception {
        try {
            cate2List.addAll(cateDao2.findAll());
            prop2List.addAll(propDao2.findAll());
        } catch (Exception e) {
            e.printStackTrace();
        }
    }

    /**
     * 地区数据加载
     */
    public static final String AREA = "[\n" +
            "  {\n" +
            "    \"name\": \"北京\",\n" +
            "    \"child\": [\n" +
            "      {\n" +
            "        \"name\": \"东城区\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"西城区\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"崇文区\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"宣武区\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"朝阳区\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"丰台区\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"石景山区\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"海淀区\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"门头沟区\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"房山区\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"通州区\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"顺义区\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"昌平区\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"大兴区\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"平谷区\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"怀柔区\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"密云县\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"延庆县\"\n" +
            "      }\n" +
            "    ]\n" +
            "  },\n" +
            "  {\n" +
            "    \"name\": \"天津\",\n" +
            "    \"child\": [\n" +
            "      {\n" +
            "        \"name\": \"和平区\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"河东区\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"河西区\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"南开区\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"河北区\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"红桥区\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"塘沽区\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"汉沽区\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"大港区\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"东丽区\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"西青区\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"津南区\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"北辰区\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"武清区\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"宝坻区\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"宁河县\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"静海县\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"蓟 县\"\n" +
            "      }\n" +
            "    ]\n" +
            "  },\n" +
            "  {\n" +
            "    \"name\": \"河北\",\n" +
            "    \"child\": [\n" +
            "      {\n" +
            "        \"name\": \"石家庄\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"唐山\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"秦皇岛\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"邯郸\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"邢台\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"保定\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"张家口\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"承德\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"沧州\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"廊坊\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"衡水\"\n" +
            "      }\n" +
            "    ]\n" +
            "  },\n" +
            "  {\n" +
            "    \"name\": \"山西\",\n" +
            "    \"child\": [\n" +
            "      {\n" +
            "        \"name\": \"太原\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"大同\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"阳泉\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"长治\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"晋城\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"朔州\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"忻州\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"吕梁\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"晋中\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"临汾\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"运城\"\n" +
            "      }\n" +
            "    ]\n" +
            "  },\n" +
            "  {\n" +
            "    \"name\": \"内蒙古\",\n" +
            "    \"child\": [\n" +
            "      {\n" +
            "        \"name\": \"呼和浩特\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"包头\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"乌海\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"赤峰\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"呼伦贝尔\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"兴安盟\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"通辽\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"锡林郭勒盟\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"乌兰察布盟\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"伊克昭盟\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"巴彦淖尔盟\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"阿拉善盟\"\n" +
            "      }\n" +
            "    ]\n" +
            "  },\n" +
            "  {\n" +
            "    \"name\": \"辽宁\",\n" +
            "    \"child\": [\n" +
            "      {\n" +
            "        \"name\": \"沈阳\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"大连\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"鞍山\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"抚顺\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"本溪\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"丹东\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"锦州\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"营口\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"阜新\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"辽阳\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"盘锦\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"铁岭\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"朝阳\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"葫芦岛\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"其他\"\n" +
            "      }\n" +
            "    ]\n" +
            "  },\n" +
            "  {\n" +
            "    \"name\": \"吉林\",\n" +
            "    \"child\": [\n" +
            "      {\n" +
            "        \"name\": \"长春\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"吉林\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"四平\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"辽源\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"通化\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"白山\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"松原\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"白城\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"延边朝鲜族自治州\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"其他\"\n" +
            "      }\n" +
            "    ]\n" +
            "  },\n" +
            "  {\n" +
            "    \"name\": \"黑龙江\",\n" +
            "    \"child\": [\n" +
            "      {\n" +
            "        \"name\": \"哈尔滨\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"齐齐哈尔\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"鹤岗\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"双鸭山\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"鸡西\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"大庆\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"伊春\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"牡丹江\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"佳木斯\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"七台河\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"黑河\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"绥化\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"大兴安岭地区\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"其他\"\n" +
            "      }\n" +
            "    ]\n" +
            "  },\n" +
            "  {\n" +
            "    \"name\": \"上海\",\n" +
            "    \"child\": [\n" +
            "      {\n" +
            "        \"name\": \"黄浦区\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"卢湾区\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"徐汇区\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"长宁区\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"静安区\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"普陀区\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"闸北区\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"虹口区\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"杨浦区\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"宝山区\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"闵行区\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"嘉定区\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"松江区\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"金山区\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"青浦区\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"南汇区\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"奉贤区\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"浦东新区\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"崇明县\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"其他\"\n" +
            "      }\n" +
            "    ]\n" +
            "  },\n" +
            "  {\n" +
            "    \"name\": \"江苏\",\n" +
            "    \"child\": [\n" +
            "      {\n" +
            "        \"name\": \"南京\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"苏州\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"无锡\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"常州\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"镇江\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"南通\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"泰州\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"扬州\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"盐城\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"连云港\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"徐州\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"淮安\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"宿迁\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"其他\"\n" +
            "      }\n" +
            "    ]\n" +
            "  },\n" +
            "  {\n" +
            "    \"name\": \"浙江\",\n" +
            "    \"child\": [\n" +
            "      {\n" +
            "        \"name\": \"杭州\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"宁波\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"温州\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"嘉兴\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"湖州\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"绍兴\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"金华\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"衢州\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"舟山\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"台州\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"丽水\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"其他\"\n" +
            "      }\n" +
            "    ]\n" +
            "  },\n" +
            "  {\n" +
            "    \"name\": \"安徽\",\n" +
            "    \"child\": [\n" +
            "      {\n" +
            "        \"name\": \"合肥\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"芜湖\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"蚌埠\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"淮南\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"马鞍山\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"淮北\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"铜陵\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"安庆\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"黄山\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"滁州\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"阜阳\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"宿州\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"巢湖\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"六安\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"亳州\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"池州\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"宣城\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"其他\"\n" +
            "      }\n" +
            "    ]\n" +
            "  },\n" +
            "  {\n" +
            "    \"name\": \"福建\",\n" +
            "    \"child\": [\n" +
            "      {\n" +
            "        \"name\": \"福州\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"厦门\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"莆田\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"三明\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"泉州\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"漳州\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"南平\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"龙岩\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"宁德\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"其他\"\n" +
            "      }\n" +
            "    ]\n" +
            "  },\n" +
            "  {\n" +
            "    \"name\": \"江西\",\n" +
            "    \"child\": [\n" +
            "      {\n" +
            "        \"name\": \"南昌\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"景德镇\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"萍乡\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"九江\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"新余\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"鹰潭\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"赣州\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"吉安\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"宜春\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"抚州\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"上饶\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"其他\"\n" +
            "      }\n" +
            "    ]\n" +
            "  },\n" +
            "  {\n" +
            "    \"name\": \"山东\",\n" +
            "    \"child\": [\n" +
            "      {\n" +
            "        \"name\": \"济南\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"青岛\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"淄博\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"枣庄\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"东营\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"烟台\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"潍坊\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"济宁\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"泰安\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"威海\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"日照\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"莱芜\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"临沂\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"德州\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"聊城\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"滨州\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"菏泽\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"其他\"\n" +
            "      }\n" +
            "    ]\n" +
            "  },\n" +
            "  {\n" +
            "    \"name\": \"河南\",\n" +
            "    \"child\": [\n" +
            "      {\n" +
            "        \"name\": \"郑州\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"开封\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"洛阳\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"平顶山\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"安阳\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"鹤壁\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"新乡\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"焦作\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"濮阳\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"许昌\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"漯河\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"三门峡\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"南阳\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"商丘\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"信阳\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"周口\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"驻马店\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"焦作\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"其他\"\n" +
            "      }\n" +
            "    ]\n" +
            "  },\n" +
            "  {\n" +
            "    \"name\": \"湖北\",\n" +
            "    \"child\": [\n" +
            "      {\n" +
            "        \"name\": \"武汉\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"黄石\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"十堰\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"荆州\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"宜昌\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"襄樊\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"鄂州\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"荆门\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"孝感\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"黄冈\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"咸宁\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"随州\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"恩施土家族苗族自治州\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"仙桃\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"天门\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"潜江\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"神农架林区\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"其他\"\n" +
            "      }\n" +
            "    ]\n" +
            "  },\n" +
            "  {\n" +
            "    \"name\": \"湖南\",\n" +
            "    \"child\": [\n" +
            "      {\n" +
            "        \"name\": \"长沙\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"株洲\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"湘潭\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"衡阳\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"邵阳\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"岳阳\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"常德\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"张家界\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"益阳\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"郴州\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"永州\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"怀化\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"娄底\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"湘西土家族苗族自治州\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"其他\"\n" +
            "      }\n" +
            "    ]\n" +
            "  },\n" +
            "  {\n" +
            "    \"name\": \"广东\",\n" +
            "    \"child\": [\n" +
            "      {\n" +
            "        \"name\": \"广州\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"深圳\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"东莞\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"中山\",\n" +
            "        \"child\": [\n" +
            "          {\n" +
            "            \"value\": \"中山\"\n" +
            "          }\n" +
            "        ]\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"潮州\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"揭阳\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"云浮\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"珠海\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"汕头\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"韶关\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"佛山\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"江门\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"湛江\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"茂名\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"肇庆\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"惠州\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"梅州\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"汕尾\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"河源\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"阳江\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"清远\"\n" +
            "      }\n" +
            "    ]\n" +
            "  },\n" +
            "  {\n" +
            "    \"name\": \"广西\",\n" +
            "    \"child\": [\n" +
            "      {\n" +
            "        \"name\": \"南宁\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"柳州\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"桂林\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"梧州\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"北海\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"防城港\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"钦州\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"贵港\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"玉林\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"百色\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"贺州\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"河池\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"来宾\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"崇左\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"其他\"\n" +
            "      }\n" +
            "    ]\n" +
            "  },\n" +
            "  {\n" +
            "    \"name\": \"海南\",\n" +
            "    \"child\": [\n" +
            "      {\n" +
            "        \"name\": \"海口\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"三亚\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"五指山\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"琼海\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"儋州\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"文昌\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"万宁\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"东方\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"澄迈县\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"定安县\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"屯昌县\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"临高县\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"白沙黎族自治县\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"昌江黎族自治县\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"乐东黎族自治县\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"陵水黎族自治县\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"保亭黎族苗族自治县\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"琼中黎族苗族自治县\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"其他\"\n" +
            "      }\n" +
            "    ]\n" +
            "  },\n" +
            "  {\n" +
            "    \"name\": \"重庆\",\n" +
            "    \"child\": [\n" +
            "      {\n" +
            "        \"name\": \"渝中区\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"大渡口区\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"江北区\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"南岸区\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"北碚区\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"渝北区\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"巴南区\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"长寿区\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"双桥区\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"沙坪坝区\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"万盛区\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"万州区\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"涪陵区\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"黔江区\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"永川区\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"合川区\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"江津区\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"九龙坡区\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"南川区\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"綦江县\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"潼南县\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"荣昌县\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"璧山县\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"大足县\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"铜梁县\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"梁平县\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"开县\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"忠县\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"城口县\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"垫江县\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"武隆县\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"丰都县\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"奉节县\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"云阳县\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"巫溪县\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"巫山县\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"石柱土家族自治县\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"秀山土家族苗族自治县\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"酉阳土家族苗族自治县\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"彭水苗族土家族自治县\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"其他\"\n" +
            "      }\n" +
            "    ]\n" +
            "  },\n" +
            "  {\n" +
            "    \"name\": \"四川\",\n" +
            "    \"child\": [\n" +
            "      {\n" +
            "        \"name\": \"成都\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"自贡\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"攀枝花\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"泸州\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"德阳\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"绵阳\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"广元\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"遂宁\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"内江\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"乐山\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"南充\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"眉山\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"宜宾\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"广安\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"达州\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"雅安\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"巴中\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"资阳\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"阿坝藏族羌族自治州\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"甘孜藏族自治州\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"凉山彝族自治州\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"其他\"\n" +
            "      }\n" +
            "    ]\n" +
            "  },\n" +
            "  {\n" +
            "    \"name\": \"贵州\",\n" +
            "    \"child\": [\n" +
            "      {\n" +
            "        \"name\": \"贵阳\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"六盘水\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"遵义\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"安顺\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"铜仁地区\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"毕节地区\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"黔西南布依族苗族自治州\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"黔东南苗族侗族自治州\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"黔南布依族苗族自治州\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"其他\"\n" +
            "      }\n" +
            "    ]\n" +
            "  },\n" +
            "  {\n" +
            "    \"name\": \"云南\",\n" +
            "    \"child\": [\n" +
            "      {\n" +
            "        \"name\": \"昆明\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"曲靖\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"玉溪\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"保山\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"昭通\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"丽江\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"普洱\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"临沧\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"德宏傣族景颇族自治州\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"怒江傈僳族自治州\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"迪庆藏族自治州\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"大理白族自治州\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"楚雄彝族自治州\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"红河哈尼族彝族自治州\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"文山壮族苗族自治州\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"西双版纳傣族自治州\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"其他\"\n" +
            "      }\n" +
            "    ]\n" +
            "  },\n" +
            "  {\n" +
            "    \"name\": \"西藏\",\n" +
            "    \"child\": [\n" +
            "      {\n" +
            "        \"name\": \"拉萨\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"那曲地区\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"昌都地区\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"林芝地区\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"山南地区\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"日喀则地区\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"阿里地区\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"其他\"\n" +
            "      }\n" +
            "    ]\n" +
            "  },\n" +
            "  {\n" +
            "    \"name\": \"陕西\",\n" +
            "    \"child\": [\n" +
            "      {\n" +
            "        \"name\": \"西安\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"铜川\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"宝鸡\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"咸阳\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"渭南\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"延安\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"汉中\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"榆林\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"安康\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"商洛\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"其他\"\n" +
            "      }\n" +
            "    ]\n" +
            "  },\n" +
            "  {\n" +
            "    \"name\": \"甘肃\",\n" +
            "    \"child\": [\n" +
            "      {\n" +
            "        \"name\": \"兰州\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"嘉峪关\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"金昌\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"白银\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"天水\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"武威\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"酒泉\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"张掖\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"庆阳\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"平凉\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"定西\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"陇南\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"临夏回族自治州\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"甘南藏族自治州\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"其他\"\n" +
            "      }\n" +
            "    ]\n" +
            "  },\n" +
            "  {\n" +
            "    \"name\": \"青海\",\n" +
            "    \"child\": [\n" +
            "      {\n" +
            "        \"name\": \"西宁\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"海东地区\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"海北藏族自治州\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"海南藏族自治州\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"黄南藏族自治州\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"果洛藏族自治州\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"玉树藏族自治州\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"海西蒙古族藏族自治州\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"其他\"\n" +
            "      }\n" +
            "    ]\n" +
            "  },\n" +
            "  {\n" +
            "    \"name\": \"宁夏\",\n" +
            "    \"child\": [\n" +
            "      {\n" +
            "        \"name\": \"银川\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"石嘴山\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"吴忠\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"固原\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"中卫\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"其他\"\n" +
            "      }\n" +
            "    ]\n" +
            "  },\n" +
            "  {\n" +
            "    \"name\": \"新疆\",\n" +
            "    \"child\": [\n" +
            "      {\n" +
            "        \"name\": \"乌鲁木齐\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"克拉玛依\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"吐鲁番地区\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"哈密地区\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"和田地区\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"阿克苏地区\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"喀什地区\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"克孜勒苏柯尔克孜自治州\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"巴音郭楞蒙古自治州\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"昌吉回族自治州\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"博尔塔拉蒙古自治州\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"石河子\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"阿拉尔\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"图木舒克\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"五家渠\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"伊犁哈萨克自治州\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"其他\"\n" +
            "      }\n" +
            "    ]\n" +
            "  },\n" +
            "  {\n" +
            "    \"name\": \"台湾\",\n" +
            "    \"child\": [\n" +
            "      {\n" +
            "        \"name\": \"台北市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"高雄市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"台北县\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"桃园县\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"新竹县\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"苗栗县\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"台中县\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"彰化县\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"南投县\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"云林县\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"嘉义县\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"台南县\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"高雄县\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"屏东县\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"宜兰县\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"花莲县\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"台东县\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"澎湖县\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"基隆市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"新竹市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"台中市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"嘉义市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"台南市\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"其他\"\n" +
            "      }\n" +
            "    ]\n" +
            "  },\n" +
            "  {\n" +
            "    \"name\": \"澳门\",\n" +
            "    \"child\": [\n" +
            "      {\n" +
            "        \"name\": \"花地玛堂区\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"圣安多尼堂区\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"大堂区\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"望德堂区\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"风顺堂区\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"嘉模堂区\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"圣方济各堂区\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"路凼\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"其他\"\n" +
            "      }\n" +
            "    ]\n" +
            "  },\n" +
            "  {\n" +
            "    \"name\": \"香港\",\n" +
            "    \"child\": [\n" +
            "      {\n" +
            "        \"name\": \"中西区\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"湾仔区\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"东区\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"南区\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"深水埗区\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"油尖旺区\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"九龙城区\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"黄大仙区\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"观塘区\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"北区\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"大埔区\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"沙田区\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"西贡区\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"元朗区\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"屯门区\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"荃湾区\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"葵青区\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"离岛区\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"name\": \"其他\"\n" +
            "      }\n" +
            "    ]\n" +
            "  }\n" +
            "]\n";
}
